#Mutable Elements
#Float
a=10.8
print(a)#10.8
print(type(a))#<class 'float'>
print(id(a))#2115027146064
b=25.
print(type(b))#<class 'float'>
c=.689
print(c)#0.689
d=3.4E2
print(d)#340.0
print(type(d))#<class 'float'>
e=9.62e-2
print(e)#0.0962
print(9.8.2)
#SyntaxError: invalid syntax. Perhaps you forgot a comma?

#Complex
a=3+4j
print(a)# (3+4j)
print(type(a)) #<class 'complex'>
print(id(a))# 1373801487184
print(a.real)#3.0
print(a.imag)#4.0
print(type(a.real))#<class 'float'>
print(type(a.imag))#<class 'float'>

a=6j
print(a)#6j
print(type(a))#<class 'complex'>
print(a.real)#0.0
print(a.imag)#6.0
print(5+j6)#NameError: name 'j6' is not defined
print(3+4i)#SyntaxError: invalid decimal literal
print(4+j)#NameError: name 'j' is not defined
print(4+1j)#(4+1j)
print(4+0j)#(4+0j)

#Octal to Binary Conversion

a=0O6247
print(a)#3239
print(type(a))#<class 'int'>
print(id(a))#2244103117680
b=0o6247
print(id(b))#2244103119280
print(b)#3239
c=3239
print(id(c))#2244103119312
print(0o9248)#SyntaxError: invalid digit '9' in octal literal

#Hexadecimal to Decimal Conversion
a=0XA7B9
print(a)#42937
print(type(a))#<class 'int'>
b=0xBEEF
print(b)#48879
print(A7B9)#NameError: name 'A7B9' is not defined
print('A7B9')#A7B9
print(0XBEER)#SyntaxError: invalid hexadecimal literal (R is not Hexadecimal Element)
print(0XHYD)#SyntaxError: invalid hexadecimal literal(HY is not Hexadecimal Element)
print(0xA7G9B)#SyntaxError: invalid hexadecimal literal(G is not Hexadecimal Element)
